benchmarks/logs/2026-04-30_baseline_quiet/burst_get_bookmarks.txt
Running 30s test @ http://localhost:8080/bookmarks
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.44ms    4.15ms  41.86ms   96.65%
    Req/Sec     2.79k   420.63     3.28k    58.67%
  Latency Distribution
     50%    1.55ms
     75%    1.58ms
     90%    3.09ms
     99%   28.89ms
  166864 requests in 30.02s, 1.76GB read
Requests/sec:   5557.98
Transfer/sec:     60.05MB