benchmarks/logs/2026-04-30_baseline_quiet/burst_get_index.txt
Running 30s test @ http://localhost:8080/
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   529.33us    1.10ms  32.36ms   94.43%
    Req/Sec    15.39k     1.89k   18.39k    56.15%
  Latency Distribution
     50%  279.00us
     75%  380.00us
     90%  489.00us
     99%    5.63ms
  922060 requests in 30.10s, 0.93GB read
Requests/sec:  30629.15
Transfer/sec:     31.72MB